renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx110/r_lpc_rx110.c
    switch (e_mode)
    {
        case LPC_OP_HIGH_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x0;   // Set to High Speed/Medium Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* do not modify OPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.OPCCR.BIT.OPCM = 0x0;     // Set to High Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;
    
        case LPC_OP_MIDDLE_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x0;   // Set to High Speed/Medium Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* do not modify OPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.OPCCR.BIT.OPCM = 0x02;    // Set to Medium Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;

        case LPC_OP_LOW_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x1;   // Set to Low Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;
        
        default:

            /* nothing here */
        break;
    }
    return LPC_SUCCESS;

}

/*********************************************************************************************************************
 End of function lpc_operating_mode_set
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_low_power_mode_configure
 * Description  : This function will configure the MCU for the specified Low Power Mode. In the Low Power Mode,
 *                the CPU is turned OFF and peripherals may be on or off depending on the mode. The supported
 *                low power modes are listed in the enum lpc_low_power_mode_t
 * Arguments    : e_mode - Low Power Mode
 *                    LPC_LP_SLEEP:
 *                    LPC_LP_DEEP_SLEEP:
 *                    LPC_LP_SW_STANDBY:
 *
 * Return Value : LPC_SUCCESS -
 ********************************************************************************************************************/
lpc_err_t lpc_low_power_mode_configure (lpc_low_power_mode_t e_mode)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
    bsp_int_ctrl_t int_ctrl;
#endif

    switch (e_mode)
    {
        case LPC_LP_SLEEP:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SBYCR.BIT.SSBY = 0;      /* Move to Sleep on R_BSP_WAIT();DSLPE also needs to be cleared */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            SYSTEM.MSTPCRC.BIT.DSLPE = 0;   /* Move to Sleep on R_BSP_WAIT() */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
        break;
        
        case LPC_LP_DEEP_SLEEP:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SBYCR.BIT.SSBY = 0;      /* Move to DeepSleep on R_BSP_WAIT(). DSLPE also needs to be set */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            SYSTEM.MSTPCRC.BIT.DSLPE = 1;   /* Move to DeepSleep on R_BSP_WAIT() */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
        break;

        case LPC_LP_SW_STANDBY:
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SBYCR.BIT.SSBY = 1;      /* Move to Sw Stby on R_BSP_WAIT() */
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
        break;
    
        default:

            /* nothing here */
        break;
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_low_power_mode_configure
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_lowpower_activate
 * Description  : This function will activate the pre-configured low power mode. The R_BSP_WAIT() function re-enables
 *                interrupts.
 * Arguments    : void (*pcallback)(void* pdata)-
 *                Call back function to configure any un-configured interrupt that can be used to wake up from the low
 *                power mode. This can be a FIT_NO_FUNC if the interrupt(s) are already configured.
 *
 * Return Value : LPC_SUCCESS - Function will return only on waking up from low power mode.
 *                LPC_ERR_OSC_STOP_ENABLED -
 *                    The Software Standby Mode cannot be activated if oscillation stop detection is enabled.
 *                LPC_ERR_ILL_CLOCK_SOURCE -
 *                    The Sleep Mode Return Clock Switch is only supported if the clock source at the time of
 *                    entry to sleep mode is allowed clock.
 *                LPC_ERR_ILL_MAIN_CLK_FREQ -
 *                    If the return mode is Medium Speed Mode and Main Osc is the return clock, then 
 *                    the system clock frequency limit over.
 *                LPC_ERR_DEEP_SLEEP_STATUS
 *                    The condition to go to a deep sleep mode isn't met.
 *                LPC_ERR_ILLEGAL
 *                    Other than those above.
 ********************************************************************************************************************/
lpc_err_t lpc_lowpower_activate (lpc_callback_set_t pcallback)
{
#if (LPC_CFG_PARAM_CHECKING_ENABLE == 1)
    lpc_err_t err;

    err = lpc_lowpower_activate_check();
    
    if (LPC_SUCCESS != err)
    {
        return err;
    }
#endif

    R_BSP_InterruptsDisable(); /* Clear the I bit to disable interrupts */
    if ((NULL != pcallback) && (FIT_NO_FUNC != pcallback)) /* If call-back is valid */
    {
        pcallback(FIT_NO_PTR); /* Call call-back to configure wake-up interrupt source */
    }
    else
    {
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP(); /* Read last written IO register to make sure it is complete */
        R_BSP_NOP(); /* or wait for 4-5 cycles till any prior write is complete */
    }

